Catalogs/АС_НастройкиИндикацииОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АС_НастройкиИндикацииОстатков</Name>
			<Comment>Общие и индивидуальные пороги цветовой индикации доступного остатка номенклатуры.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Пустое значение используется только у предопределённой общей настройки.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пороги</Name>
					<Comment>Цвет применяется к остатку не больше указанного количества и больше предыдущего порога.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Верхняя включительная граница диапазона остатка.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветHEX</Name>
							<Comment>Цвет фона в формате #RRGGBB.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АС_НастройкиИндикацииОстатков/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)

	ЭтоОбщаяИндикация = Предопределенный
		И ИмяПредопределенныхДанных = "ОбщаяИндикация";

	Если ЭтоОбщаяИндикация Тогда
		Если ПометкаУдаления Тогда
			Сообщить("Общую индикацию нельзя пометить на удаление.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		Наименование = "Общая индикация";
	Иначе
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			Сообщить("Выберите номенклатуру для индивидуальной индикации.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|Настройки.Ссылка КАК Ссылка
			|ИЗ
			|Справочник.АС_НастройкиИндикацииОстатков КАК Настройки
			|ГДЕ
			|Настройки.Номенклатура = &Номенклатура
			|И Настройки.Ссылка <> &ТекущаяНастройка
			|И НЕ Настройки.ПометкаУдаления");
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("ТекущаяНастройка", Ссылка);
		Если Не Запрос.Выполнить().Пустой() Тогда
			Сообщить("Для выбранной номенклатуры уже существует индивидуальная индикация.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Наименование = Строка(Номенклатура);
	КонецЕсли;

	Если Пороги.Количество() = 0 Тогда
		Сообщить("Добавьте хотя бы один порог индикации.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ИспользованныеПороги = Новый Соответствие;
	Для Каждого СтрокаПорога Из Пороги Цикл
		Если ИспользованныеПороги.Получить(СтрокаПорога.Количество) <> Неопределено Тогда
			Сообщить("Одинаковый порог остатка указан несколько раз: " + Строка(СтрокаПорога.Количество));
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		ИспользованныеПороги.Вставить(СтрокаПорога.Количество, Истина);

		Если ПустаяСтрока(СтрокаПорога.ЦветHEX) Тогда
			Сообщить("Выберите цвет для порога " + Строка(СтрокаПорога.Количество) + ".");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Попытка
			РаботаСЦветомСервер.ЦветПоHEX(СтрокаПорога.ЦветHEX);
		Исключение
			Сообщить("Некорректный цвет у порога " + Строка(СтрокаПорога.Количество) + ".");
			Отказ = Истина;
			Возврат;
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// Наименование не редактируется пользователем: оно заполняется из
	// выбранной номенклатуры в ПередЗаписью. Стандартная проверка выполняется
	// раньше ПередЗаписью, поэтому скрытое поле нужно исключить из неё.
	ИндексНаименования = ПроверяемыеРеквизиты.Найти("Наименование");
	Если ИндексНаименования <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ИндексНаименования);
	КонецЕсли;

КонецПроцедуры

Процедура ПередУдалением(Отказ)

	Если Предопределенный И ИмяПредопределенныхДанных = "ОбщаяИндикация" Тогда
		Сообщить("Общую индикацию нельзя удалить.");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры
